app/controllers/application_controller.rb

   def check_user_logged_in
    if session[:user_token] == nil
      redirect_to sessions_sign_in_path
    else
      @current_user = User.find_by(token: session[:user_token])
---
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "OJMUpI0Xkh6JUemJL20Ezg=="], ["LIMIT", 1]]