app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "heomapmap@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:user][:email])