app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "name", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save