app/models/user.rb

  def generate_user_token
    begin
      new_u_token = SecureRandom.base64
    end while User.find_by(token: new_u_token)
---
SELECT  "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "OJMUpI0Xkh6JUemJL20Ezg=="], ["LIMIT", 1]]